3B/CS486/02-Agents-and-Abstraction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-10 Thu 18:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Agents And Abstraction</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Agents And Abstraction</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org69b2d2d">1. Agents</a></li>
<li><a href="#org915b221">2. Knowledge Representation</a></li>
<li><a href="#orgd631816">3. Dimensions of Complexity</a>
<ul>
<li><a href="#org96ff49c">3.1. Planning Horizon</a></li>
<li><a href="#orgb11969a">3.2. Representation</a></li>
<li><a href="#orgd3a89d3">3.3. Computational Limits</a></li>
<li><a href="#org022b2c1">3.4. Learning from Experience*</a></li>
<li><a href="#org15b1705">3.5. Uncertainty</a>
<ul>
<li><a href="#orgf2c0fd8">3.5.1. Uncertain World Dynamics</a></li>
</ul>
</li>
<li><a href="#org1e3c1d2">3.6. Goals or Complex Preferences</a></li>
<li><a href="#org613cab9">3.7. Reasoning by Number of Agents</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org69b2d2d" class="outline-2">
<h2 id="org69b2d2d"><span class="section-number-2">1.</span> Agents</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Agent</b>: an entity that performs actions in its environment
</p>

<p>
The agent and environment make up the world. The black box that comprises the agent
contains the belief state.
</p>

<p>
Agents can have properties such as:
</p>
<ul class="org-ul">
<li><b>abilities</b>: what actions can the agent perform</li>
<li><b>stimuli</b>: what and how can the agent sense in its environment</li>
<li><b>prior knowledge</b>: knowledge about agent capabilities and environment</li>
<li><b>past experience</b>: which and when actions are useful</li>
<li><b>goals</b>: what the agent must achieve</li>
</ul>
</div>
</div>
<div id="outline-container-org915b221" class="outline-2">
<h2 id="org915b221"><span class="section-number-2">2.</span> Knowledge Representation</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>Knowledge</b>: info used to solve tasks
</p>

<p>
<b>Representation</b>: data structures used to encode knowledge
</p>

<p>
<b>Knowledge Base (KB)</b>: representation of all knowledge
</p>

<p>
<b>Model</b>: relationship of KB to world
</p>

<p>
<b>Level of Abstraction</b>: model accuracy level
</p>

<p>
For AI agents:
</p>
<ol class="org-ol">
<li>specify what needs to be computed</li>
<li>specify how the world works</li>
<li>agent figures out how to do the computation</li>
</ol>
</div>
</div>
<div id="outline-container-orgd631816" class="outline-2">
<h2 id="orgd631816"><span class="section-number-2">3.</span> Dimensions of Complexity</h2>
<div class="outline-text-2" id="text-3">
<p>
There are 9 dimensions of complexity that make up the agent design space:
</p>
<ol class="org-ol">
<li><b>Modularity</b>: flat \(\to\) modular \(\to\) hierarchical</li>
<li><b>Planning Horizon</b>: non-planning \(\to\) finite horizon \(\to\) indefinite horizon \(\to\) infinite horizon</li>
<li><b>Representation</b>: explicit states \(\to\) features \(\to\) individuals and relations</li>
<li><b>Computational Limits</b>: perfect rationality \(\to\) bounded rationality</li>
<li><b>Learning</b>: knowledge is given \(\to\) knowledge is learned</li>
<li><b>Uncertainty</b>: fully observable \(\to\) partially observable
<ol class="org-ol">
<li>world dynamics: deterministic \(\to\) stochastic</li>
</ol></li>
<li><b>Preference</b>: goals \(\to\) complex preferences</li>
<li><b>Reasoning by Number of Agents</b>: single agent \(\to\) adversarial \(\to\) multi-agent</li>
<li><b>Interactivity</b>: offline \(\to\) online</li>
</ol>
</div>
<div id="outline-container-org96ff49c" class="outline-3">
<h3 id="org96ff49c"><span class="section-number-3">3.1.</span> Planning Horizon</h3>
<div class="outline-text-3" id="text-3-1">
<p>
How far the agent looks into the future when deciding what to do:
</p>
<ul class="org-ul">
<li><b>static</b>: world does not change</li>
<li><b>finite horizon</b>: agent reasons about a fixed finite number of time steps</li>
<li><b>indefinite horizon</b>: agent is reasoning about finite, but not predetermined, number of time steps</li>
<li><b>infinite horizon</b>: agent plans to go on forever (process oriented)</li>
</ul>
</div>
</div>
<div id="outline-container-orgb11969a" class="outline-3">
<h3 id="orgb11969a"><span class="section-number-3">3.2.</span> Representation</h3>
<div class="outline-text-3" id="text-3-2">
<p>
AI is about finding compact representations and exploiting compactness for computational gains.
An agent can reason in terms of:
</p>
<ul class="org-ul">
<li><b>explicit states</b>: state directly represents one way the world could be</li>
<li><b>features/propositions</b>: describe states in terms of features</li>
<li><b>individuals/relations</b>: a feature for each relationship on each tuple of individuals</li>
</ul>
</div>
</div>
<div id="outline-container-orgd3a89d3" class="outline-3">
<h3 id="orgd3a89d3"><span class="section-number-3">3.3.</span> Computational Limits</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><b>perfect rationality</b>: agent always chooses the optimal solution</li>
<li><b>bounded rationality</b>: agent chooses an action given its limited computational capacity
<ul class="org-ul">
<li>satisficing solution is good enough</li>
<li>approximately optimal solution is has some defined acceptable error</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org022b2c1" class="outline-3">
<h3 id="org022b2c1"><span class="section-number-3">3.4.</span> Learning from Experience*</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Knowledge is either <b>given</b> or <b>learned</b> from data/past experience.
</p>
</div>
</div>
<div id="outline-container-org15b1705" class="outline-3">
<h3 id="org15b1705"><span class="section-number-3">3.5.</span> Uncertainty</h3>
<div class="outline-text-3" id="text-3-5">
<p>
What about the state the agent can determine from observations:
</p>
<ul class="org-ul">
<li><b>fully observable</b>: the agent knows the state of the world from observations</li>
<li><b>partially observable</b>: can be many possible states given an observation</li>
</ul>
</div>
<div id="outline-container-orgf2c0fd8" class="outline-4">
<h4 id="orgf2c0fd8"><span class="section-number-4">3.5.1.</span> Uncertain World Dynamics</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
If the agent knew initial states and actions, is the resulting state known?
</p>

<p>
Dynamics can be:
</p>
<ul class="org-ul">
<li><b>deterministic</b>: state resulting from carrying out an action in state is determined from the
action and the state</li>
<li><b>stochastic</b>: uncertainty over states resulting from executing a given action in a given state</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1e3c1d2" class="outline-3">
<h3 id="org1e3c1d2"><span class="section-number-3">3.6.</span> Goals or Complex Preferences</h3>
<div class="outline-text-3" id="text-3-6">
<p>
<b>Achievement Goal</b>: goal to achieve, can be complex logical formula
</p>

<p>
<b>Maintenance Goal</b>: goal to be maintained
</p>

<p>
<b>Complex Preferences</b>: may involve trade-offs between desiderata, can be ordinal or cardinal
</p>
</div>
</div>
<div id="outline-container-org613cab9" class="outline-3">
<h3 id="org613cab9"><span class="section-number-3">3.7.</span> Reasoning by Number of Agents</h3>
<div class="outline-text-3" id="text-3-7">
<p>
<b>Single Agent Reasoning</b>: an agent assumes that any other agents are part of the environment
</p>

<p>
<b>Adversarial Reasoning</b>: considers other agents to be opposition
</p>

<p>
<b>Multi-agent Reasoning</b>: an agent needs to reason strategically about the reasoning of other agents
</p>

<p>
Agents can be cooperative, competitive, or have independent goals.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-10-10 Thu 18:13</p>
</div>
</body>
</html>
